# GetBuiltInCategoryTypeId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Category..::..GetBuiltInCategoryTypeId Method
Category Class See Also
---
Gets the ForgeTypeId identifying the given built-in category.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public static ForgeTypeId GetBuiltInCategoryTypeId(
	BuiltInCategory categoryId
)
```

Visual Basic
---
```text
Public Shared Function GetBuiltInCategoryTypeId ( _
	categoryId As BuiltInCategory _
) As ForgeTypeId
```

Visual C++
---
```text
public:
static ForgeTypeId^ GetBuiltInCategoryTypeId(
	BuiltInCategory categoryId
)
```

# ### Parameters
categoryId
    Type: Autodesk.Revit.DB..::..BuiltInCategory The built-in category.
# ### Return Value
The identifier of the given built-in category.
# Remarks
The given BuiltInCategory value must be valid according to Category.IsBuiltInCategoryValid(BuiltInCategory).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | categoryId is not a valid built-in category. See Category.IsBuiltInCategoryValid(BuiltInCategory). |

# See Also
Category Class
Autodesk.Revit.DB Namespace